from string import Template

#### RAG Prompts ####

#### System ####
system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة بناءً فقط على الوثائق المقدمة.",
    "تجاهل الوثائق التي لا تتعلق بسؤال المستخدم.",
    "إذا لم تتمكن من الإجابة بناءً على الوثائق، اعتذر للمستخدم بأدب.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في إجابتك. تجنب المعلومات غير الضرورية.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## الوثيقة رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template(
    "\n".join([
        "بناءً فقط على الوثائق أعلاه، يرجى توليد إجابة مناسبة لسؤال المستخدم.",
        "## السؤال: ",
        "$query",
        "",
        "## الإجابة: ",
    ])
)
